XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G31x_Series.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ABOV</vendor>
  <name>A31G31x_Series</name>
  <description>ABOV Semiconductor G3 Series Device Support, Drivers and Examples</description>
  <url>https://www.abov.co.kr/data/mds/PACK/</url>
  <supportContact>abov_fae@abov.co.kr</supportContact>
  <releases>
    <release version="1.0.0" date="2020-01-17">
            - Added device : A31G313, A31G314, A31G316
    </release>
  </releases>
  <keywords>
    <!-- keywords for indexing -->
    <keyword>ABOV</keyword>
    <keyword>A31G31x</keyword>
    <keyword>A31G313</keyword>
    <keyword>A31G314</keyword>
    <keyword>A31G316</keyword>
    <keyword>General Purpose</keyword>
  </keywords>
  <devices>
    <family Dfamily="A31G31x Series" Dvendor="ABOV Semiconductor:126">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" />
      <description>The ABOV G3 Series device family contains an ARM Cortex-M0+ processor with a versatile set of on-chip peripherals
          </description>
      <!-- Subfamily : A31G31x *********************************************************-->
      <subFamily DsubFamily="A31G31x">
        <processor Dclock="48000000" />
        <compile header="A31G31x/Core/include/A31G31x.h" />
        <debug svd="A31G31x/SVD/A31G31x.svd" />
        <feature type="VCC" n="1.8" m="5.5" />
        <feature type="Temp" n="-40" m="85" />
        <memory id="IRAM1" start="0x20000000" size="0x4000" init="0" default="1" />
        <!-- Device : A31G313-->
        <device Dname="A31G313">
          <description>Package type 64 LQFP 12/10, 48 LQFP, 48 QFN, 44 LQFP</description>
          <algorithm name="A31G31x\Flashloader\A31G313_64.FLM" start="0x00000000" size="0x10000" default="1" />
          <memory id="IROM1" start="0x00000000" size="0x10000" startup="1" default="1" />
        </device>
        <!-- Device : A31G314-->
        <device Dname="A31G314">
          <description>Package type 80 LQFP 14/12, 64 LQFP 12/10, 48 LQFP, 48 QFN, 44 LQFP</description>
          <algorithm name="A31G31x\Flashloader\A31G314_128.FLM" start="0x00000000" size="0x20000" default="1" />
          <memory id="IROM1" start="0x00000000" size="0x20000" startup="1" default="1" />
        </device>
        <!-- Device : A31G316-->
        <device Dname="A31G316">
          <description>Package type 80 LQFP 14/12, 64 LQFP 12/10</description>
          <algorithm name="A31G31x\Flashloader\A31G316_256.FLM" start="0x00000000" size="0x40000" default="1" />
          <memory id="IROM1" start="0x00000000" size="0x40000" startup="1" default="1" />
        </device>
      </subFamily>
    </family>
  </devices>
  <conditions>
    <!-- condition : A31G313/314/316 ********************************************************-->
    <condition id="A31G31x CMSIS">
      <description>A31G313/314/316 device and CMSIS-Core</description>
      <require Tcompiler="ARMCC" />
      <require Cclass="CMSIS" Cgroup="CORE" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31G313" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31G314" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A31G316" />
    </condition>
  </conditions>
  <components>
    <!-- component : A31G313/314/316 ********************************************************-->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>System Startup for ABOV A31G313/314/316 devices</description>
      <files>
        <file category="include" name="A31G31x/Core/include/" />
        <file category="include" name="A31G31x/Drivers/include/" />
        <file category="header" version="1.0.0" name="A31G31x/Core/include/A31G31x.h" attr="config" />
        <file category="header" version="1.0.0" name="A31G31x/Core/include/system_A31G31x.h" attr="config" />
        <file category="source" version="1.0.0" name="A31G31x/Core/source/ARM/startup_A31G31x.s" attr="config" />
        <file category="source" version="1.0.0" name="A31G31x/Core/source/system_A31G31x.c" attr="config" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Debug_frameWork" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x debug framework</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/aa_types.h" />
        <file category="header" name="A31G31x/Drivers/include/slib.h" />
        <file category="header" name="A31G31x/Drivers/include/debug_frmwrk.h" />
        <file category="source" name="A31G31x/Drivers/source/slib.c" />
        <file category="source" name="A31G31x/Drivers/source/debug_frmwrk.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="adc" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x adc control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_adc.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_adc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="cmp" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x comparator control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_comp.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_comp.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="crc" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x crc control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_crc.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_crc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="dac" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x dac control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_dac.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_dac.c" />
      </files>
    </component>
