XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G31x_Series.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="dmac" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x dmac control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_dmac.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_dmac.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="i2c" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x i2c control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_i2c.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_i2c.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="lcd" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x lcd control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_lcd.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_lcd.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="pcu" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x pcu control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_pcu.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_pcu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="pwr" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x pwr control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_pwr.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_pwr.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="scu" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x scu control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_scu.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_scu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="timer1n" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x 16-bit timer control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_timer1n.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_timer1n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="timer2n" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x 32-bit timer control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_timer2n.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_timer2n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="timer3n" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x 6-ch PWM timer control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_timer30.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_timer30.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="uart" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x uart control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_uartn.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_uartn.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="usart" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x usart control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_usart1n.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_usart1n.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="wdt" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x watch dog timer control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_wdt.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_wdt.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="wt" Cversion="1.0.0" condition="A31G31x CMSIS">
      <description>A31G31x watch timer control</description>
      <files>
        <file category="header" name="A31G31x/Drivers/include/A31G31x_wt.h" />
        <file category="source" name="A31G31x/Drivers/source/A31G31x_wt.c" />
      </files>
    </component>
  </components>
  <boards>
    <!-- board : A31G314 ************************************************************-->
    <board vendor="ABOV" name="StarterKit-A31G314MMN" revision="V1.1">
      <description>StarterKit-31G314MMN</description>
      <mountedDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A31G314" />
      <compatibleDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A31G313" />
      <compatibleDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A31G316" />
      <feature type="XTAL" n="16000000" />
      <feature type="PWR" n="5" name="USB Powered" />
      <feature type="PWR" n="3.3" m="5" name="External Supply" />
      <feature type="Button" n="2" name="Tact-buttons: User and Reset" />
      <feature type="LED" n="6" name="LEDs: D101~106" />
	  <debugInterface adapter="A-Link (CMSIS-DAP)" connector="USB Mini 5 pin"/>
    </board>
  </boards>
  <examples>
    <!-- example : A31G313/314/316 **********************************************************-->
    <example name="ABOV ADC Interrupt" doc="Abstract.txt" folder="A31G31x/Examples/ADC/Adc_Interrupt">
      <description>ADC Interrupt example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Adc_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC Polling" doc="Abstract.txt" folder="A31G31x/Examples/ADC/Adc_Polling">
      <description>ADC Polling example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Adc_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC Timer Trigger" doc="Abstract.txt" folder="A31G31x/Examples/ADC/Adc_TimerTrigger">
      <description>ADC Timer trigger example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Adc_TimerTrigger.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV Clock" doc="Abstract.txt" folder="A31G31x/Examples/ClkChange/ClkChange_test">
      <description>Clock Change example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/ClkChange_test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CMP Interrupt" doc="Abstract.txt" folder="A31G31x/Examples/CMP/CMP_interrupt">
      <description>Comparator Interrupt example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CMP_interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CMP Polling" doc="Abstract.txt" folder="A31G31x/Examples/CMP/CMP_polling">
      <description>Comparator Polling example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CMP_polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC CCITT" doc="Abstract.txt" folder="A31G31x/Examples/CRC/CRC_CCITT">
      <description>CRC CCITT example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CRC_CCITT.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC CCITT DMA RAM" doc="Abstract.txt" folder="A31G31x/Examples/CRC/CRC_CCITT_DMA_RAM">
      <description>CRC CCITT DMA RAM example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CRC_CCITT_DMA_RAM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC Checksum" doc="Abstract.txt" folder="A31G31x/Examples/CRC/CRC_Checksum">
      <description>CRC Checksum example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CRC_Checksum.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC Checksum DMA RAM" doc="Abstract.txt" folder="A31G31x/Examples/CRC/CRC_Checksum_DMA_RAM">
      <description>CRC Checksum DMA RAM example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CRC_Checksum_DMA_RAM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC CRC16" doc="Abstract.txt" folder="A31G31x/Examples/CRC/CRC_CRC16">
      <description>CRC CRC16 example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CRC_CRC16.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CRC CRC16 DMA RAM" doc="Abstract.txt" folder="A31G31x/Examples/CRC/CRC_CRC16_DMA_RAM">
      <description>CRC CRC16 DMA RAM example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/CRC_CRC16_DMA_RAM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DAC Interrupt" doc="Abstract.txt" folder="A31G31x/Examples/DAC/DAC_interrupt">
      <description>DAC Interrupt example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/DAC_interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DAC Polling" doc="Abstract.txt" folder="A31G31x/Examples/DAC/DAC_polling">
      <description>DAC Polling example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/DAC_polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV DAC Timer Trigger" doc="Abstract.txt" folder="A31G31x/Examples/DAC/DAC_TimerTrigger">
      <description>DAC Timer Trigger example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/DAC_timer_test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV FMC Erase Write" doc="Abstract.txt" folder="A31G31x/Examples/FMC/FMC_WriteErase">
      <description>FMC Erase Write example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/FMC_WriteErase.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV FMC Erase Write (Self PGM)" doc="Abstract.txt" folder="A31G31x/Examples/FMC/FMC_WriteErase_selfPGM">
      <description>FMC Erase Write (Self PGM) example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/FMC_WriteErase_selfPGM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV FMC Erase Write (in RAM)" doc="Abstract.txt" folder="A31G31x/Examples/FMC/FMC_WriteErase2_lock_inRAM">
      <description>FMC Erase Write (in RAM) example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/FMC_WriteErase2_lock_inRAM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO External Interrupt" doc="Abstract.txt" folder="A31G31x/Examples/GPIO/Gpio_ExtInt">
      <description>GPIO External Interrupt example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Gpio_ExtInt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO Input" doc="Abstract.txt" folder="A31G31x/Examples/GPIO/Gpio_Input">
      <description>GPIO Input example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Gpio_Input.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO LED Blinky" doc="Abstract.txt" folder="A31G31x/Examples/GPIO/Gpio_LedBlinky">
      <description>GPIO LED Blinky example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Gpio_LedBlinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV I2C" doc="Abstract.txt" folder="A31G31x/Examples/I2C/I2C_MasterSlave">
      <description>I2C example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/I2C_MasterSlave.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV LCD" doc="Abstract.txt" folder="A31G31x/Examples/LCD/LCD_test">
      <description>LCD example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/LCD_test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR LVI" doc="Abstract.txt" folder="A31G31x/Examples/PWR/LVI">
      <description>PWR LVI example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/LVI.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR Deep Sleep" doc="Abstract.txt" folder="A31G31x/Examples/PWR/PWR_DeepSleep">
      <description>PWR Deep Sleep example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/PWR_DeepSleep.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWR Sleep" doc="Abstract.txt" folder="A31G31x/Examples/PWR/PWR_Sleep">
      <description>PWR Sleep example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/PWR_Sleep.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n Capture" doc="Abstract.txt" folder="A31G31x/Examples/TIMER1n/Timer_Capture">
      <description>TIMER1n Capture example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Timer_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n Match Interrupt" doc="Abstract.txt" folder="A31G31x/Examples/TIMER1n/Timer_MatchInterrupt">
      <description>TIMER1n Match Interrupt example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Timer_MatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n Match Polling" doc="Abstract.txt" folder="A31G31x/Examples/TIMER1n/Timer_MatchPolling">
      <description>TIMER1n Match Polling example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Timer_MatchPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n One Shot" doc="Abstract.txt" folder="A31G31x/Examples/TIMER1n/Timer_OneShot">
      <description>TIMER1n One Shot example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Timer_OneShot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER1n PWM" doc="Abstract.txt" folder="A31G31x/Examples/TIMER1n/Timer_PWM">
      <description>TIMER1n PWM example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Timer_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n Capture" doc="Abstract.txt" folder="A31G31x/Examples/TIMER2n/TIMER2n_Capture">
      <description>TIMER2n Capture example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER2n_Capture.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n Match Interrupt" doc="Abstract.txt" folder="A31G31x/Examples/TIMER2n/TIMER2n_MatchInterrupt">
      <description>TIMER2n Match Interrupt example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER2n_MatchInterrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n Match Polling" doc="Abstract.txt" folder="A31G31x/Examples/TIMER2n/TIMER2n_MatchPolling">
