XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A31G31x_Series.pdsc
      <description>TIMER2n Match Polling example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER2n_MatchPolling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n One Shot" doc="Abstract.txt" folder="A31G31x/Examples/TIMER2n/TIMER2n_OneShot">
      <description>TIMER2n One Shot example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER2n_OneShot.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER2n PWM" doc="Abstract.txt" folder="A31G31x/Examples/TIMER2n/TIMER2n_PWM">
      <description>TIMER2n PWM example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER2n_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER30" doc="Abstract.txt" folder="A31G31x/Examples/TIMER30/TIMER30_PWM">
      <description>TIMER30 example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/TIMER30_PWM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UART Interrupt" doc="Abstract.txt" folder="A31G31x/Examples/UART/Uart_Interrupt">
      <description>UART Interrupt example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Uart_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UART Interrupt Tx" doc="Abstract.txt" folder="A31G31x/Examples/UART/Uart_Interrupt_Tx">
      <description>UART Interrupt Tx example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Uart_Interrupt_Tx.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UART Polling" doc="Abstract.txt" folder="A31G31x/Examples/UART/Uart_Polling">
      <description>UART Polling example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Uart_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UART Polling DMA" doc="Abstract.txt" folder="A31G31x/Examples/UART/Uart_Polling_dma">
      <description>UART Polling DMA example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Uart_Polling_dma.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART SPI Interrupt" doc="Abstract.txt" folder="A31G31x/Examples/USART/SPI_Interrupt">
      <description>USART SPI Interrupt example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SPI_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART SPI Polling" doc="Abstract.txt" folder="A31G31x/Examples/USART/SPI_Polling">
      <description>USART SPI Polling example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/SPI_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART UART Interrupt" doc="Abstract.txt" folder="A31G31x/Examples/USART/Uart_Interrupt">
      <description>USART UART Interrupt example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Uart_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART UART Polling" doc="Abstract.txt" folder="A31G31x/Examples/USART/Uart_Polling">
      <description>USART UART Polling example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Uart_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART USRT Interrupt" doc="Abstract.txt" folder="A31G31x/Examples/USART/Usrt_Interrupt">
      <description>USART USRT Interrupt example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Usrt_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USART USRT Polling" doc="Abstract.txt" folder="A31G31x/Examples/USART/Usrt_Polling">
      <description>USART USRT Polling example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Usrt_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USB HID" doc="Abstract.txt" folder="A31G31x/Examples/USB/HID_VolumeControl">
      <description>USB HID example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/USB_test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV USB VCP" doc="Abstract.txt" folder="A31G31x/Examples/USB/VCP_test">
      <description>USB VCP example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/VCP_test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT Interrupt" doc="Abstract.txt" folder="A31G31x/Examples/WDT/Wdt_Interrupt">
      <description>WDT Interrupt example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Wdt_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT Reset" doc="Abstract.txt" folder="A31G31x/Examples/WDT/Wdt_Reset">
      <description>WDT Reset example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Wdt_Reset.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WT" doc="Abstract.txt" folder="A31G31x/Examples/WT/Wt_test">
      <description>WT example (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Wt_test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="Starter Kit - Gpio_LedBlinky" doc="Abstract.txt" folder="A31G31x/Examples/StarterKit/Gpio_LedBlinky">
      <description>Starter Kit - Gpio_LedBlinky (A31G313/314/316)</description>
      <board name="StarterKit-A31G314MMN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil/Gpio_LedBlinky.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>
</package>
